import avatar_profile from "../../img/avatar_profile.png"
import classes from "./profile.module.scss"

const body = {
    name:"Иван",
    surname:"Иванов",
    email:"vezhliviy@yandex.ru",
    phone:"+7 (999) 909-99-99",
    events:[
        {
            img:avatar_profile,
            title:"Благотворительная акция",
            location:"г. Ростов-на-Дону, пл. Гагарина 1",
            date:"27.05 - 29.05",
            id:""
        },
        {
            img:avatar_profile,
            title:"Благотворительная акция",
            location:"г. Ростов-на-Дону, пл. Гагарина 1",
            date:"27.05 - 29.05",
            id:""
        },
        {
            img:avatar_profile,
            title:"Благотворительная акция",
            location:"г. Ростов-на-Дону, пл. Гагарина 1",
            date:"27.05 - 29.05",
            id:""
        },
        {
            img:avatar_profile,
            title:"Благотворительная акция",
            location:"г. Ростов-на-Дону, пл. Гагарина 1",
            date:"27.05 - 29.05",
            id:""
        },
        {
            img:avatar_profile,
            title:"Благотворительная акция",
            location:"г. Ростов-на-Дону, пл. Гагарина 1",
            date:"27.05 - 29.05",
            id:""
        },
        {
            img:avatar_profile,
            title:"Благотворительная акция",
            location:"г. Ростов-на-Дону, пл. Гагарина 1",
            date:"27.05 - 29.05",
            id:""
        },
        {
            img:avatar_profile,
            title:"Благотворительная акция",
            location:"г. Ростов-на-Дону, пл. Гагарина 1",
            date:"27.05 - 29.05",
            id:""
        },
        {
            img:avatar_profile,
            title:"Благотворительная акция",
            location:"г. Ростов-на-Дону, пл. Гагарина 1",
            date:"27.05 - 29.05",
            id:""
        }

    ]
}

const ProfileCard = ({body})=>{
    const {avatar,name,surname,visited_count,reputation,email,phone} = body
    return (
        <div className={classes.ProfileCard}>
            <div className={classes.userinfo}>
                <img src={avatar||avatar_profile}/>
                <h2>{name} {surname}</h2>
                <p>Посещено мероприятий:</p>
                <p data-visited> {visited_count||"0"}</p>
            </div>
            <div className={`${classes.userstats} ${classes.max_width}`}>
                <h2>Репутация: {reputation||0}</h2>
                <h2>Отзывы: </h2>
                <p></p>
            </div>
            <div className={`${classes.usercontacts} ${classes.max_width}`}>
                <h2>Контактная информация:</h2>
                <div >
                    <svg width="22" height="17" viewBox="0 0 22 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M11.5914 8.91686C11.4153 9.04279 11.2076 9.10568 11 9.10568C10.7923 9.10568 10.5847 9.04279 10.4086 8.91686L1.99999 2.90068L6.66665e-05 1.46979L0 15.2849C6.66665e-05 15.8237 0.447732 16.2605 0.999997 16.2605L21 16.2605C21.5523 16.2605 22 15.8236 22 15.2849V1.46973L19.9999 2.90068L11.5914 8.91686Z" fill="#909ADE"/>
                        <path d="M10.9988 6.92061L20.6712 6.50076e-05L1.32617 0L10.9988 6.92061Z" fill="#909ADE"/>
                    </svg>
                    <a  href={`mailto:${email}`}>{email}</a>
                </div>
                <div>
                    <svg width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M20.7749 15.9263C19.9931 14.4483 17.2785 12.8457 17.159 12.7756C16.8102 12.577 16.4462 12.4719 16.1056 12.4719C15.5991 12.4719 15.1845 12.704 14.9334 13.126C14.5363 13.601 14.0438 14.1563 13.9243 14.2423C12.9993 14.87 12.2752 14.7987 11.474 13.9974L7.00253 9.52485C6.2064 8.72862 6.13321 7.99546 6.75649 7.07541C6.84369 6.95509 7.39883 6.46217 7.87378 6.06463C8.17666 5.88436 8.38455 5.61648 8.47564 5.28787C8.59672 4.85062 8.50757 4.33628 8.22182 3.83517C8.15447 3.71992 6.55132 1.00454 5.07431 0.223102C4.79869 0.0770928 4.48802 0 4.17658 0C3.66348 0 3.18075 0.20013 2.81792 0.562622L1.82987 1.55042C0.267215 3.11291 -0.298441 4.8841 0.147699 6.81454C0.519872 8.42336 1.60447 10.1354 3.3719 11.9027L9.09658 17.6282C11.3335 19.8654 13.4661 21 15.4352 21C15.4352 21 15.4352 21 15.4356 21C16.8838 21 18.2339 20.3844 19.4473 19.1708L20.435 18.183C21.0353 17.583 21.1716 16.6758 20.7749 15.9263Z" fill="#909ADE"/>
                    </svg>
                    <a data-line-off href={`tel:${phone}`}>{phone}</a>
                </div>
            </div>
        </div>
    )
}

const Dashboard = ({events})=>{
    return (
        <div className={classes.Dashboard}>
            <h2>Посещенные мероприятия</h2>
            <div className={classes.DashboardItems}>
                {events.map((e,i)=>(
                    <ItemCard key={i} item={e}/>
                ))}
            </div>
            <h2>Созданные мероприятия</h2>
        </div>
    )
}

const ItemCard = ({item})=>{
    return (
        <div className={classes.ItemCard}>
            <div className={classes.itemImg} style={{
                backgroundImage:`url(${item.img})`,
            }}></div>
            <h2>{item.title}</h2>
            <hr/>
            <div>
                <svg width="19" height="19" viewBox="0 0 19 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M9.49929 0C5.62805 0 2.47852 3.14948 2.47852 7.02077C2.47852 10.7688 8.87898 18.5092 9.15144 18.8368C9.23739 18.9402 9.36484 19 9.49929 19C9.63368 19 9.76119 18.9402 9.84714 18.8368C10.1197 18.5091 16.5201 10.7688 16.5201 7.02077C16.5201 3.14948 13.3706 0 9.49929 0ZM9.49929 17.8297C8.93176 17.121 7.75261 15.6112 6.58577 13.8851C4.49071 10.7861 3.38328 8.41242 3.38328 7.02077C3.38328 3.64836 6.12694 0.904762 9.49929 0.904762C12.8716 0.904762 15.6153 3.64836 15.6153 7.02077C15.6153 8.41236 14.5079 10.786 12.4128 13.8851C11.2459 15.6112 10.0668 17.121 9.49929 17.8297Z" fill="#3D7199"/>
                    <path d="M11.8008 12.9057C11.5938 12.7658 11.3126 12.8203 11.1727 13.0273C10.5623 13.931 9.87839 14.8781 9.1401 15.8424C8.98822 16.0407 9.02586 16.3247 9.22425 16.4765C9.30628 16.5394 9.40297 16.5698 9.49893 16.5698C9.63489 16.5698 9.76939 16.5087 9.85842 16.3924C10.6076 15.414 11.302 14.4523 11.9224 13.5338C12.0623 13.3268 12.0079 13.0456 11.8008 12.9057Z" fill="#3D7199"/>
                    <path d="M9.49859 3.46777C7.45316 3.46777 5.78906 5.13187 5.78906 7.1773C5.78906 9.22272 7.45316 10.8868 9.49859 10.8868C11.544 10.8868 13.2081 9.22272 13.2081 7.1773C13.2081 5.13187 11.544 3.46777 9.49859 3.46777ZM9.49859 9.98206C7.95205 9.98206 6.69382 8.72384 6.69382 7.1773C6.69382 5.63076 7.95205 4.37254 9.49859 4.37254C11.0452 4.37254 12.3033 5.63076 12.3033 7.1773C12.3033 8.72384 11.0452 9.98206 9.49859 9.98206Z" fill="#3D7199"/>
                </svg>
                <p>{item.location}</p>

            </div>
            <div>
                <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M0.937513 0H14.0625C14.58 0 15 0.419529 15 0.937513V14.0625C15 14.58 14.58 15 14.0625 15H0.937513C0.420012 14.9999 0 14.58 0 14.0625V0.937513C0 0.419529 0.420012 0 0.937513 0Z" fill="#EDEEF0"/>
                    <path d="M14.0625 0H0.937513C0.420012 0 0 0.419529 0 0.937513V3.28124H14.9999V0.937513C14.9999 0.419529 14.58 0 14.0625 0Z" fill="#3D7199"/>
                    <path d="M10.1606 7.94371C9.99562 7.94371 9.82405 7.97232 9.68949 8.02808L9.67449 8.01399C9.92106 7.68493 10.4072 7.23632 10.7062 6.89323C10.7957 6.78776 10.8633 6.70387 10.8633 6.6059C10.8633 6.35371 10.5412 6.0945 10.3327 6.0945C10.2722 6.0945 10.1902 6.0945 10.1081 6.14373C10.0186 6.19998 9.92856 6.25574 9.86856 6.31155C9.11339 6.97015 7.96922 8.45607 7.96922 9.51357C7.96922 10.4455 8.69439 11.2512 9.84606 11.2512C10.9523 11.2512 11.7225 10.4248 11.7225 9.51357C11.723 8.68619 11.0578 7.94371 10.1606 7.94371ZM9.84655 10.2415C9.39793 10.2415 9.13594 9.90546 9.13594 9.51261C9.13594 9.09961 9.42 8.78465 9.84655 8.78465C10.3177 8.78465 10.5572 9.14182 10.5572 9.51261C10.5567 9.9195 10.2722 10.2415 9.84655 10.2415ZM6.427 10.3076H5.01001C5.66812 9.54544 6.86859 8.56154 6.86859 7.57202C6.86859 6.66686 6.10217 6.08984 5.14971 6.08984C4.19725 6.08984 3.33002 6.8094 3.33002 7.707C3.33002 7.98448 3.52313 8.22686 3.89487 8.22686C4.63832 8.22686 4.21268 7.07278 5.10332 7.07278C5.42065 7.07278 5.66068 7.3292 5.66068 7.62119C5.66068 7.87761 5.52896 8.09836 5.38974 8.28402C4.801 9.06774 4.10394 9.70855 3.46131 10.414C3.38396 10.4998 3.2832 10.6277 3.2832 10.7773C3.2832 11.1054 3.54664 11.2475 3.88743 11.2475H6.47397C6.76789 11.2475 7.03133 11.1054 7.03133 10.7773C7.03122 10.4496 6.76735 10.3076 6.427 10.3076Z" fill="#324D5B"/>
                    <path d="M0 2.8125H14.9999V3.75001H0V2.8125Z" fill="#0D5185"/>
                    <path d="M7.50001 0.9375C7.75921 0.9375 7.96876 1.14748 7.96876 1.40626C7.96876 1.66503 7.75921 1.87501 7.50001 1.87501C7.2408 1.87501 7.03125 1.66503 7.03125 1.40626C7.03125 1.14748 7.24075 0.9375 7.50001 0.9375Z" fill="#0D5185"/>
                    <path d="M14.0625 14.0625H0.937513C0.420012 14.0625 0 13.6425 0 13.125V14.0625C0 14.58 0.420012 15 0.937513 15H14.0625C14.58 15 15 14.58 15 14.0625V13.125C14.9999 13.6425 14.58 14.0625 14.0625 14.0625Z" fill="#C4C4C4"/>
                </svg>
                <p>{item.date}</p>
            </div>
        </div>
    )
}

const Profile = ()=>{
    return (
        <div className="content">
            <div className={classes.Profile}>
                <ProfileCard body={body}/>
                <Dashboard events={body.events}/>
            </div>
        </div>
    )
}

export default Profile